<?php
/*Задание №1
Объявить две целочисленные переменные $a и $b и задать им произвольные начальные значения.
Затем написать скрипт, который работает по следующему принципу:
-если $a и $b положительные, вывести их разность;
-если $а и $b отрицательные, вывести их произведение;
-если $а и $b разных знаков, вывести их сумму;
ноль можно считать положительным числом.*/

$min = -20;
$max = 20;

$a = random_int($min, $max);
$b = random_int($min, $max);

if ($a >= 0 && $b >= 0)
    echo "Разность чисел $a и $b = " . ($a-$b);
elseif ($a <0 && $b <0)
    echo "Произведение чисел $a и $b = " . $a*$b;
else
    echo "Сумма чисел $a и $b = " . ($a+$b);