<?php
/*Задание №1
Объявить две целочисленные переменные $a и $b и задать им произвольные начальные значения.
Затем написать скрипт, который работает по следующему принципу:
-если $a и $b положительные, вывести их разность;
-если $а и $b отрицательные, вывести их произведение;
-если $а и $b разных знаков, вывести их сумму;
ноль можно считать положительным числом.*/
echo "Задание№1</br>";

$min = -20;
$max = 20;

$a = random_int($min, $max);
$b = random_int($min, $max);

if ($a >= 0 && $b >= 0)
    echo "Разность чисел $a и $b = " . ($a-$b);
elseif ($a <0 && $b <0)
    echo "Произведение чисел $a и $b = " . $a*$b;
else
    echo "Сумма чисел $a и $b = " . ($a+$b);

/*Задание №2
Присвоить переменной $а значение в промежутке [0..15]. С помощью оператора switch организовать вывод чисел от $a до 15.*/
echo "</br></br>Задание№2</br>";

$min = 0;
$max = 15;
$a = random_int($min, $max);
switch ($a){
    case 0:
        echo "0 ";
    case 1:
        echo "1 ";
    case 2:
        echo "2 ";
    case 3:
        echo "3 ";
    case 4:
        echo "4 ";
    case 5:
        echo "5 ";
    case 6:
        echo "6 ";
    case 7:
        echo "7 ";
    case 8:
        echo "8 ";
    case 9:
        echo "9 ";
    case 10:
        echo "10 ";
    case 11:
        echo "11 ";
    case 12:
        echo "12 ";
    case 13:
        echo "13 ";
    case 14:
        echo "14 ";
    case 15:
        echo "15";
}