<?php
//Lesson 1 Задание №1. - Установил OpenServer и PHP Storm
//Lesson 1 Задание №2. - Все примеры понятны, на вебинаре все было подробно рассказано про это.
//Lesson 1 Задание №3. Объяснить, как работает данный код:

$a = 5;
$b = '05';
var_dump($a == $b); // Почему true? - Потому что '05' преобразовалось в числовой тип, и $b стала равна  '5'
var_dump((int)'012345');      // Почему 12345? - При помощи (int) мы строку преобразовали в числовой тип данных, и ноль вначале у чисел не пишется
var_dump((float)123.0 === (int)123.0); // Почему false? - Три знака равно сравнивают не только значения, но еще и тип данных. В данном случае тип данных не совпадает.
var_dump((int)0 === (int)'hello, world'); // Почему true? - При попытке привести строку к числовому типу данных, если в ней нет на первом месте цифры, будет возвращен ноль, с типом данных int

/**Lesson 1 Задание №4. В приведенном шаблоне сайта сделать динамически меняющиеся области, через задание переменных (заменить функцию getdate() на date():
 * - данное задание выполенно в файле index2.php*/

//Lesson 1 Задание №5:
$a = 10;
$b = 26;

$a = $a + $b; //$a = 36
$b = $a - $b; // $b = 10
$a = $a - $b; // $a = 26

echo '<br/>$a = '.$a.'<br/>$b = '.$b;
