<?php
/*Задание №1
С помощью цикла while вывести все числа в любом промежутке, которые делятся на заданное число без остатка.*/
echo "Задание№1</br>";

$min = -20;
$max = 20;

$a = random_int($min, $max);
$abs = random_int($min, $max);
echo "В промежутке от $a до $max, без остатка на $abs деляться следующие числа:</br>";
while ($a <= $max) {
    if ($abs == 0) {
        break;
    } elseif ($a % $abs == 0) {
        echo "$a, ";
    }
    $a++;
}
/*Задание №2
2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.*/
echo "</br></br>Задание№2</br>";

const VALSTART = 0;
const VALEND = 10;
$a = VALSTART;

do{
    if ($a == 0){
        echo "$a - ноль </br>";
    }
    elseif ($a % 2 == 0){
        echo "$a - четное число </br>";
    }
    else{
        echo "$a - нечетное число </br>";
    }
    $a++;
}while($a<=VALEND);

/*Задание №3 Объявить массив, в котором в качестве ключей будут использоваться названия областей,
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область …*/
echo "</br></br>Задание№3</br>";

$myArrayRegion["Московская область"] = ["Москва", "Зеленоград", "Клин"];
$myArrayRegion["Ленинградская область"] = ["Санкт-Петербург", "Всеволжск", "Павловск", "Кронштадт"];
$myArrayRegion["Рязанская область"] = ["Касимов", "Рязань", "Шилово"];

foreach ($myArrayRegion as $keyRegion => $region){
    echo "</br>$keyRegion:</br>";
    foreach ($region as $city){
        echo "$city, ";
    }
}
/*Задание №3* или №8 Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».*/
echo "</br></br>Задание№3* или №8</br>";

$myArrayRegion["Московская область"] = ["Москва", "Зеленоград", "Клин"];
$myArrayRegion["Ленинградская область"] = ["Санкт-Петербург", "Всеволжск", "Павловск", "Кронштадт"];
$myArrayRegion["Рязанская область"] = ["Касимов", "Рязань", "Шилово"];
$find = "К";

foreach ($myArrayRegion as $keyRegion => $region){
    echo "</br>$keyRegion:</br>";
    foreach ($region as $city){
        if (stripos($city, $find) === 0) {
            echo "$city, ";
        }
    }
}

/*Задание №4,5 и 9 Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие
латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.*/
echo "</br></br>Задание№4, 5 и 9</br>";

$translit = ['а' => 'a','б' => 'b', 'в' => 'v',
            'г' => 'g', 'д' => 'd', 'е' => 'e',
            'ё' => 'yo', 'ж' => 'zh', 'з' => 'z',
            'и' => 'i', 'й' => 'y', 'к' => 'k',
            'л' => 'l', 'м' => 'm', 'н' => 'n',
            'о' => 'o', 'п' => 'p', 'р' => 'r',
            'с' => 's', 'т' => 't', 'у' => 'u',
            'ф' => 'f', 'х' => 'kh', 'ц' => 'ts',
            'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shch',
            'ъ' => '"', 'ы' => 'y', 'ь' => '\'',
            'э' => 'e', 'ю' => 'yu', 'я' => 'ya', ' ' => '_'];
$word = "Подъезд №7";
echo strtr($word, $translit);
/*Задание №6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP.
Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню
с вложенными подменю? Попробовать его реализовать.*/
echo "</br></br>Задание№6</br>";
?>
    <a href="task6.php">Ссылка на задание№6</a>

<?php
/*Задание №7. *Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так:
for (…){ // здесь пусто}*/
echo "</br></br>Задание№7</br>";

$i=0;
$j=9;
for ($i; $i<$j; $i++, (print "$i ")){}

?>